#### SUMMARY STATISTICS

<br>

## Census Variables
<hr>

### Assessing Variable Types

In [14]:
import pandas as pd

census = pd.read_csv('census_data.csv', index_col = 0)
census.head()

,first_name,last_name,birth_year,voted,num_children,income_year,higher_tax,marital_status
0,Denise,Ratke,2005,False,0,92129.41,disagree,single
1,Hali,Cummerata,1987,False,0,75649.17,neutral,divorced
2,Salomon,Orn,1992,True,2,166313.45,agree,single
3,Sarina,Schiller,1965,False,2,71704.81,strongly agree,married
4,Gust,Abernathy,1945,False,2,143316.08,agree,married

In [15]:
census.dtypes

first_name         object
last_name          object
birth_year         object
voted                bool
num_children        int64
income_year       float64
higher_tax         object
marital_status     object
dtype: object

### Inspecting Datatypes

In [16]:
census['birth_year'].unique()

array(['2005', '1987', '1992', '1965', '1945', '1951', '1963', '1949',
       '1950', '1971', '2007', '1944', '1995', '1973', '1946', '1954',
       '1994', '1989', '1947', '1993', '1976', '1984', 'missing', '1966',
       '1941', '2000', '1953', '1956', '1960', '2001', '1980', '1955',
       '1985', '1996', '1968', '1979', '2006', '1962', '1981', '1959',
       '1977', '1978', '1983', '1957', '1961', '1982', '2002', '1998',
       '1999', '1952', '1940', '1986', '1958'], dtype=object)

### Altering Data

In [17]:
census['birth_year'] = census['birth_year'].replace(['missing'], '1967')
census['birth_year'].unique()

array(['2005', '1987', '1992', '1965', '1945', '1951', '1963', '1949',
       '1950', '1971', '2007', '1944', '1995', '1973', '1946', '1954',
       '1994', '1989', '1947', '1993', '1976', '1984', '1967', '1966',
       '1941', '2000', '1953', '1956', '1960', '2001', '1980', '1955',
       '1985', '1996', '1968', '1979', '2006', '1962', '1981', '1959',
       '1977', '1978', '1983', '1957', '1961', '1982', '2002', '1998',
       '1999', '1952', '1940', '1986', '1958'], dtype=object)

In [18]:
census['birth_year'] = census['birth_year'].astype('int')
census['birth_year'].unique()

array([2005, 1987, 1992, 1965, 1945, 1951, 1963, 1949, 1950, 1971, 2007,
       1944, 1995, 1973, 1946, 1954, 1994, 1989, 1947, 1993, 1976, 1984,
       1967, 1966, 1941, 2000, 1953, 1956, 1960, 2001, 1980, 1955, 1985,
       1996, 1968, 1979, 2006, 1962, 1981, 1959, 1977, 1978, 1983, 1957,
       1961, 1982, 2002, 1998, 1999, 1952, 1940, 1986, 1958])

In [19]:
census.dtypes

first_name         object
last_name          object
birth_year          int32
voted                bool
num_children        int64
income_year       float64
higher_tax         object
marital_status     object
dtype: object

In [20]:
census['birth_year'].mean()

1973.4

In [21]:
census['higher_tax'] = pd.Categorical(census['higher_tax'], ['strongly disagree', 'disagree', 'neutral', 'agree', 'strongly agree'], ordered = True)
census['higher_tax'].unique()

['disagree', 'neutral', 'agree', 'strongly agree', 'strongly disagree']
Categories (5, object): ['strongly disagree' < 'disagree' < 'neutral' < 'agree' < 'strongly agree']

In [22]:
census.head()

,first_name,last_name,birth_year,voted,num_children,income_year,higher_tax,marital_status
0,Denise,Ratke,2005,False,0,92129.41,disagree,single
1,Hali,Cummerata,1987,False,0,75649.17,neutral,divorced
2,Salomon,Orn,1992,True,2,166313.45,agree,single
3,Sarina,Schiller,1965,False,2,71704.81,strongly agree,married
4,Gust,Abernathy,1945,False,2,143316.08,agree,married

In [23]:
census['higher_tax'] = census['higher_tax'].cat.codes
census.head()

,first_name,last_name,birth_year,voted,num_children,income_year,higher_tax,marital_status
0,Denise,Ratke,2005,False,0,92129.41,1,single
1,Hali,Cummerata,1987,False,0,75649.17,2,divorced
2,Salomon,Orn,1992,True,2,166313.45,3,single
3,Sarina,Schiller,1965,False,2,71704.81,4,married
4,Gust,Abernathy,1945,False,2,143316.08,3,married

In [24]:
census['higher_tax'].median()

2.0

In [25]:
census = pd.get_dummies(data = census, columns = ['marital_status'])
census.head()

,first_name,last_name,birth_year,voted,num_children,income_year,higher_tax,marital_status_divorced,marital_status_married,marital_status_single,marital_status_widowed
0,Denise,Ratke,2005,False,0,92129.41,1,0,0,1,0
1,Hali,Cummerata,1987,False,0,75649.17,2,1,0,0,0
2,Salomon,Orn,1992,True,2,166313.45,3,0,0,1,0
3,Sarina,Schiller,1965,False,2,71704.81,4,0,1,0,0
4,Gust,Abernathy,1945,False,2,143316.08,3,0,1,0,0